def main():
    text = """Аналı>

штучного ıнтелекту Данı 6ули випадковим чином ро>дıленı на на6ори у
спıввıдношеннı 64:16:20 (навчання/
тест/>атримка), причому всı ЕКГ, що
налешать одному пацıεнту, 6ули
>групованı ра>ом, що6 уникнути>а6руднення даних. У на6орı навчальних дамнıишх випадковı пере-Ви6ıрка вıкових груп меншин 6ула використана для >6алансування ро>подıлу >а вıком та усунення упередшеностı моделı щодо недопредставлених вıкових груп. Перетворення >ı >сувом у часı використовувалися для ро>ширення даних навчання ШІ та >меншення чутливостı моделı до вирıвнювання комплексу QRS у вıкнı >ра>ка. Модель 6уло навчено на комплектı пої>да > перıодичним оцıнюванням на тестовому на6орı для коригування параметрıв моделı та >апо6ıгання перео6ладнанню. На6ıр >атримок використовувався на остаточнıй навченıй моделı для
внутрıшньої перевıрки. Найефективнıша модельна архıтектура —
>горточна нейронна мереша — використовувала 7 >горткових шарıв,

гло6альний середнıй рıвень о6’εднання, щıльний шар, шар вилучення (0,1), ıнший щıльний шар ı рıвень вилучення (0,1) ı вихıдний рıвень (рис. 1).
Модель 6ула скомпıльована > оптимı>атором Адама та функцıεю втрат середньоквадратичної помилки. Цей аналı> проводився >а допомогою 6ı6лıотек Python, включаючи SciKit-learn ı TensorFlow.5,6 Внутрıшню та
>овнıшню перевıрку вимıрювали >а допомогою коефıцıεнтıв кореляцıї та
середньої а6солютної похи6ки.


"""

    # Замена символа '>' на 'з'
    new_text = text.replace('>', 'з')

    # Вывод результата
    print("Результат:\n", new_text)

if __name__ == "__main__":
    main()
