def main():
    text = """Оскࠢльки основною гࠢпотезою про залежнࠢсть
мࠢж ознаками та вࠢком є те, що вона нелࠢнࠢйна,
для неї потрࠢбна вࠢдповࠢдна модель. Існує кࠢлька
сࠢмейств моделей, призначених для
моделювання нелࠢнࠢйних даних, а саме
полࠢномࠢальних моделей, нейронних мереж,
SVM з рࠢзними ядрами та машин пࠢдвищення
градࠢєнта. Ми вибрали останнࠢ, тому що вони
менше схильнࠢдо переобладнання та добре
працюють ࠢз наборами даних, якࠢскладаються
з численних ознак рࠢзних типࠢв (категорࠢйних ࠢчислових)."""

    # Замена символа '>' на 'з'
    new_text = text.replace('ࠢ', 'і')

    # Вывод результата
    print("Результат:\n", new_text)

if __name__ == "__main__":
    main()
